Revit 2026 API

# DefinitionsGetEnumerator Method

---

Retrieves an enumerator to the collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<Definition> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of Definition)
```
```cpp
public:
virtual IEnumerator<Definition^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<Definition>
override GetEnumerator : unit -> IEnumerator<Definition>
```

#### Return Value

IEnumeratorDefinitionThe enumerator.

#### Implements

IEnumerableTGetEnumerator

#### Reference

Definitions Class

Autodesk.Revit.DB Namespace